<details ><summary>plan for monitoring 2025-03-07 07:25:29 (UTC)</summary>
        <details ><summary>Locking successful</summary>
  Project LumeWeb/pinner.xyz-devops#monitoring has been locked by PR #32
</details>

<details open="true"><summary>Plan output</summary>

```terraform
OpenTofu will perform the following actions:

  # module.grafana.module.grafana_deployment.akash_deployment.service will be updated in-place
  ~ resource "akash_deployment" "service" {
        id                            = "20530792:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
      ~ sdl                           = (sensitive value)
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.mysql.module.mysql_deployment.akash_deployment.service will be updated in-place
  ~ resource "akash_deployment" "service" {
        id                            = "20530788:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
      ~ sdl                           = (sensitive value)
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.prometheus.module.prometheus_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (monitoring)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |                                 RESOURCE                                  |
|--------|---------------------------------------------------------------------------|
| add    | `module.prometheus.module.prometheus_deployment.akash_deployment.service` |
| update | `module.grafana.module.grafana_deployment.akash_deployment.service`       |
|        | `module.mysql.module.mysql_deployment.akash_deployment.service`           |

</details>

</details>